In [2]:
import pandas as pd

In [13]:
df = pd.read_csv('df_estudo_pandas_vendas.csv', sep=';')

In [ ]:
df.head()   # mostra as primeiras 5 linhas do DataFrame

,id_venda,produto,categoria,regiao,vendedor,qtd,preco_unitario,mes,faturamento
0,1,Mochila,Acessórios,Norte,Daniela,3,179,Mai,537
1,2,Boné,Acessórios,Sudeste,Bruno,1,41,Jan,41
2,3,Jaqueta,Vestuário,Norte,Fernanda,1,334,Mar,334
3,4,Mochila,Acessórios,Sudeste,Daniela,5,178,Jan,890
4,5,Tênis,Calçados,Sul,Carlos,6,264,Jun,1584

In [ ]:
df.tail() # mostra as últimas 5 linhas do DataFrame

,id_venda,produto,categoria,regiao,vendedor,qtd,preco_unitario,mes,faturamento
115,116,Boné,Acessórios,Sul,Eduardo,3,47,Fev,141
116,117,Camiseta,Vestuário,Sul,Daniela,5,74,Abr,370
117,118,Meia,Calçados,Centro-Oeste,Eduardo,6,9,Mai,54
118,119,Blusa,Vestuário,Sudeste,Carlos,9,86,Mai,774
119,120,Jaqueta,Vestuário,Norte,Daniela,5,321,Mai,1605

In [22]:
df.shape  # mostra a quantidade de linhas e colunas do DataFrame

(120, 9)

Maior venda do mês "Mar"

In [36]:
df_filter = df[df['mes'] == 'Mar']
df_filter['faturamento'].max()

np.int64(2640)

Vendas Totais do mês de "Jan"

In [44]:
df_filter = df[df['mes'] == 'Jan']
df_filter ['faturamento'].sum()

np.int64(14147)

Faturamento > 2000

In [48]:
df_filter = df[df['faturamento'] >2000] #importante para prova!
df_filter

,id_venda,produto,categoria,regiao,vendedor,qtd,preco_unitario,mes,faturamento
6,7,Jaqueta,Vestuário,Nordeste,Ana,9,309,Jan,2781
15,16,Jaqueta,Vestuário,Sul,Ana,7,305,Abr,2135
19,20,Tênis,Calçados,Sul,Eduardo,9,257,Mar,2313
30,31,Jaqueta,Vestuário,Nordeste,Daniela,10,323,Abr,3230
39,40,Tênis,Calçados,Centro-Oeste,Bruno,10,250,Mai,2500
60,61,Tênis,Calçados,Nordeste,Carlos,9,235,Fev,2115
82,83,Jaqueta,Vestuário,Centro-Oeste,Carlos,8,330,Mar,2640
85,86,Tênis,Calçados,Norte,Daniela,10,253,Jun,2530

Região Sudeste + produto Camiseta

In [49]:
df_filter = df[ (df['regiao']=='Sudeste') & (df['produto']=='Camiseta')]
df_filter

,id_venda,produto,categoria,regiao,vendedor,qtd,preco_unitario,mes,faturamento
31,32,Camiseta,Vestuário,Sudeste,Ana,2,70,Jan,140

Maior Faturamento

In [53]:
df['faturamento'].max()

np.int64(3230)

Top 5 Maiores Vendas (Faturamento)

In [57]:
df_top5 = df.sort_values('faturamento',ascending=True).head(5)
df_top5

,id_venda,produto,categoria,regiao,vendedor,qtd,preco_unitario,mes,faturamento
51,52,Meia,Calçados,Centro-Oeste,Fernanda,1,5,Jan,5
108,109,Meia,Calçados,Sul,Carlos,1,7,Abr,7
49,50,Meia,Calçados,Nordeste,Bruno,4,7,Fev,28
113,114,Meia,Calçados,Nordeste,Daniela,3,11,Mai,33
66,67,Boné,Acessórios,Sudeste,Ana,1,37,Mai,37

Media De faturamento por Mês

In [60]:
df_filter = df.groupby('mes')['faturamento'].mean().reset_index()
df_filter

   mes  faturamento
0  Abr   769.318182
1  Fev   848.875000
2  Jan   643.045455
3  Jun   970.062500
4  Mai   638.518519
5  Mar   625.352941

Soma De faturamento Por mês

In [62]:
df_filter = df.groupby('mes')['faturamento'].sum().reset_index()
df_filter

   mes  faturamento
0  Abr        16925
1  Fev        13582
2  Jan        14147
3  Jun        15521
4  Mai        17240
5  Mar        10631

Faturamento Total Por Produto

In [63]:
df_filter = df.groupby('produto')['faturamento'].sum().reset_index()
df_filter

    produto  faturamento
0     Blusa         6476
1      Boné         4848
2     Calça        12711
3  Camiseta         2626
4   Jaqueta        21173
5      Meia         1666
6   Mochila        19884
7     Tênis        18662

Faturamento Total por região (ordenado)

In [73]:
df_filter = df.groupby ('regiao')['faturamento'].sum().reset_index().sort_values('faturamento',ascending = False).head(6)
df_filter

         regiao  faturamento
4           Sul        21500
1      Nordeste        19669
2         Norte        19103
0  Centro-Oeste        19010
3       Sudeste         8764

Produto com maior quantidade total vendido

In [76]:
df_filter = df.groupby('produto')['qtd'].sum(0).reset_index().head().sort_values('qtd',ascending=False)
df_filter

    produto  qtd
1      Boné  120
2     Calça   97
0     Blusa   72
4   Jaqueta   67
3  Camiseta   43

In [ ]:
df['mes'] .reset_index() # Para pegar apenas uma coluna do DataFrame

     index  mes
0        0  Mai
1        1  Jan
2        2  Mar
3        3  Jan
4        4  Jun
..     ...  ...
115    115  Fev
116    116  Abr
117    117  Mai
118    118  Mai
119    119  Mai

[120 rows x 2 columns]